Tekla Open API Reference for Tekla Structures 2025
Operation.CreateShapeFromGeometry Method
 Create a new shape in the shape catalog, based on the part geometry.
 Namespace: Tekla.Structures.Model.Operations
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static string CreateShapeFromGeometry(
	Part originalPart
)
Public Shared Function CreateShapeFromGeometry (
	originalPart As Part
) As String
Parameters
originalPart
Type: Tekla.Structures.Model.Part
Original part
Return Value
Type: String
The newly created shape name, or empty string on failure
Exceptions
Exception | Condition
ArgumentNullException | Thrown if the originalPart is null.
See Also
Reference
Operation Class
Tekla.Structures.Model.Operations Namespace